logs/istio-increased/rollout-probe-activator-direct-ingressgateway-more-resources.log
{"level":"info","ts":1694421426.1805923,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/09/11 08:37:06 Running rollout probe test with selector: serving.knative.dev/service=activator-with-cc
2023/09/11 08:37:07 Inferred first revision = activator-with-cc-00001
2023/09/11 08:37:36 Updating the service: activator-with-cc
2023/09/11 08:37:36 Successfully updated the service.
Requests      [total, rate, throughput]         179999, 999.99, 431.00
Duration      [total, attack, wait]             3m30s, 3m0s, 30s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.136ms, 17.708s, 20.798s, 30.001s, 30.001s, 30.003s, 30.101s
Bytes In      [total, mean]                     2162383, 12.01
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           50.28%
Status Codes  [code:count]                      0:89488  200:90511  
Error Set:
Get "http://activator-with-cc.default.svc.cluster.local?sleep=100": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Get "http://activator-with-cc.default.svc.cluster.local?sleep=100": dial tcp 0.0.0.0:0->172.30.194.206:80: bind: address already in use
2023/09/11 08:40:36 Shutting down InfluxReporter
2023/09/11 08:40:36 SLA 1 failed. P95 latency is not in 100-110ms time range: 30.000925248s